-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1:3306
-- Généré le : ven. 04 fév. 2022 à 07:12
-- Version du serveur : 5.7.36
-- Version de PHP : 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `rike_game`
--

-- --------------------------------------------------------

--
-- Structure de la table `gamesaves`
--

DROP TABLE IF EXISTS `gamesaves`;
CREATE TABLE IF NOT EXISTS `gamesaves` (
  `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT,
  `saveId` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `score` decimal(8,2) NOT NULL,
  `lvlclick` decimal(8,2) NOT NULL,
  `lvlauto` decimal(8,2) NOT NULL,
  `seed` int(11) NOT NULL,
  `design` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=52 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `gamesaves`
--

INSERT INTO `gamesaves` (`id`, `saveId`, `score`, `lvlclick`, `lvlauto`, `seed`, `design`, `created_at`, `updated_at`) VALUES
(1, 'AZERTY', '15.00', '3.00', '2.00', 75, 'pineA', NULL, NULL),
(2, 'QSDRFG', '0.00', '0.00', '0.00', 42, 'pineA', '2022-02-03 13:42:25', '2022-02-03 13:42:25'),
(3, 'HJKLMN', '0.00', '0.00', '0.00', 42, 'pineA', '2022-02-03 13:43:13', '2022-02-03 13:43:13'),
(4, 'HJKLMN', '0.00', '0.00', '0.00', 42, 'pineA', '2022-02-03 14:16:46', '2022-02-03 14:16:46'),
(5, 'HJKLMN', '0.00', '0.00', '0.00', 42, 'pineA', '2022-02-03 14:18:15', '2022-02-03 14:18:15'),
(6, 'ASEFTH', '10.00', '10.00', '10.00', 10, '', NULL, NULL),
(21, 'z		', '20.00', '0.00', '0.00', 34, NULL, '2022-02-03 21:13:59', '2022-02-03 21:13:59'),
(22, 't4h5pe', '11.00', '0.00', '0.00', 40, NULL, '2022-02-03 21:16:35', '2022-02-03 21:16:35'),
(23, 'EKY7Z0', '91.00', '0.00', '0.00', 77, NULL, '2022-02-03 21:18:14', '2022-02-03 21:18:14'),
(24, 'KY7Z0G', '74.00', '0.00', '0.00', 77, NULL, '2022-02-03 21:18:30', '2022-02-03 21:18:30'),
(25, 'OAJLZ6', '53.00', '0.00', '0.00', 88, NULL, '2022-02-03 21:25:33', '2022-02-03 21:25:33'),
(26, 'V7FIKO', '21.00', '0.00', '0.00', 44, NULL, '2022-02-03 21:54:30', '2022-02-03 21:54:30'),
(27, 'D1JVT7', '9.00', '0.00', '0.00', 19, NULL, '2022-02-03 22:14:02', '2022-02-03 22:14:02'),
(28, 'YS5RAL', '0.00', '0.00', '0.00', 1, NULL, '2022-02-03 22:18:24', '2022-02-03 22:18:24'),
(29, '4JPI08', '0.00', '0.00', '0.00', 78, NULL, '2022-02-03 22:19:20', '2022-02-03 22:19:20'),
(30, '0CSJVV', '0.00', '0.00', '0.00', 24, NULL, '2022-02-03 22:20:52', '2022-02-03 22:20:52'),
(31, 'GO5BTA', '0.00', '0.00', '0.00', 24, NULL, '2022-02-03 22:21:21', '2022-02-03 22:21:21'),
(32, 'TY5BT0', '51.00', '2.00', '1.00', 24, 'pineA,pineB', '2022-02-03 22:22:42', '2022-02-03 22:22:42'),
(33, 'ZK3R30', '10.00', '1.00', '1.00', 4, NULL, '2022-02-03 23:29:53', '2022-02-03 23:29:53'),
(34, 'CTXMTE', '0.00', '0.00', '0.00', 23, NULL, '2022-02-03 23:35:13', '2022-02-03 23:35:13'),
(35, 'K5VUQ5', '0.00', '0.00', '0.00', 90, NULL, '2022-02-03 23:37:16', '2022-02-03 23:37:16'),
(36, 'KGJ8GL', '0.00', '0.00', '0.00', 38, NULL, '2022-02-03 23:39:38', '2022-02-03 23:39:38'),
(37, '7JN8TZ', '0.00', '0.00', '0.00', 38, NULL, '2022-02-03 23:39:41', '2022-02-03 23:39:41'),
(38, 'MBAAWV', '0.00', '0.00', '0.00', 38, NULL, '2022-02-03 23:39:53', '2022-02-03 23:39:53'),
(39, 'EKY7Z0', '0.00', '0.00', '0.00', 77, NULL, '2022-02-03 23:40:46', '2022-02-03 23:40:46'),
(40, '5W3IOK', '0.00', '0.00', '0.00', 86, NULL, '2022-02-03 23:42:45', '2022-02-03 23:42:45'),
(41, 'LN8FIT', '0.00', '0.00', '0.00', 41, NULL, '2022-02-03 23:52:02', '2022-02-03 23:52:02'),
(42, 'HONTXJ', '0.00', '0.00', '0.00', 89, NULL, '2022-02-03 23:53:23', '2022-02-03 23:53:23'),
(43, 'HJRVJR', '0.00', '0.00', '0.00', 50, NULL, '2022-02-03 23:54:16', '2022-02-03 23:54:16'),
(44, '76OF3X', '0.00', '0.00', '0.00', 50, NULL, '2022-02-03 23:54:21', '2022-02-03 23:54:21'),
(45, 'DAFOP6', '14.00', '2.00', '1.00', 47, 'pineA,pineB,pineC', '2022-02-04 01:30:38', '2022-02-04 01:30:38'),
(46, 'A38IZP', '108.00', '3.00', '1.00', 47, 'pineA,pineB,pineC', '2022-02-04 01:31:28', '2022-02-04 01:31:28'),
(47, 'EOV653', '2.00', '2.00', '1.00', 65, 'pineA,pineB', '2022-02-04 01:42:40', '2022-02-04 01:42:40'),
(48, 'PVL3WH', '39.00', '2.00', '2.00', 65, 'pineA,pineB,pineA', '2022-02-04 01:43:17', '2022-02-04 01:43:17'),
(49, '8FITBJ', '37.00', '2.00', '1.00', 41, 'pineA,pineB', '2022-02-04 01:49:39', '2022-02-04 01:49:39'),
(50, 'XMTEBH', '31.00', '2.00', '1.00', 23, 'pineA,pineC', '2022-02-04 05:35:21', '2022-02-04 05:35:21'),
(51, 'ABBXOG', '0.00', '0.00', '0.00', 22, NULL, '2022-02-04 06:05:32', '2022-02-04 06:05:32');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
